Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_52 (Conv2D)           (None, 85, 85, 64)        1088      
_________________________________________________________________
activation_41 (Activation)   (None, 85, 85, 64)        0         
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 42, 42, 64)        0         
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 39, 39, 128)       131200    
_________________________________________________________________
activation_42 (Activation)   (None, 39, 39, 128)       0         
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 19, 19, 128)       0         
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 17, 17, 256)       295168    
_________________________________________________________________
activation_43 (Activation)   (None, 17, 17, 256)       0         
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 15, 15, 256)       590080    
_________________________________________________________________
activation_44 (Activation)   (None, 15, 15, 256)       0         
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 13, 13, 128)       295040    
_________________________________________________________________
activation_45 (Activation)   (None, 13, 13, 128)       0         
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 6, 6, 128)         0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 4608)              0         
_________________________________________________________________
dense_32 (Dense)             (None, 128)               589952    
_________________________________________________________________
activation_46 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_33 (Dense)             (None, 32)                4128      
_________________________________________________________________
activation_47 (Activation)   (None, 32)                0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_34 (Dense)             (None, 1)                 33        
_________________________________________________________________
activation_48 (Activation)   (None, 1)                 0         
=================================================================
Total params: 1,906,689
Trainable params: 1,906,689
Non-trainable params: 0
_________________________________________________________________
